[
  {
    "url": "https://www.bbc.com/news/articles/c4g8r34nxeno",
    "title": "Musk says Grok chatbot was 'manipulated' into praising Hitler",
    "timestamp": "2025-07-10T12:02:11.679Z",
    "author": null,
    "category": "innovation",
    "tags": [],
    "content": "Elon Musk has sought to explain how his artificial intelligence (AI) firm's chatbot, Grok, praised Hitler.\"Grok was too compliant to user prompts,\" Musk wrote on X. \"Too eager to please and be manipulated, essentially. That is being addressed.\"Screenshots published on social media show the chatbot saying the Nazi leader would be the best person to respond to alleged \"anti-white hate.\"Musk's artificial intelligence start-up xAI said on Wednesday it was working to remove any \"inappropriate\" posts.\n\nADL, an organisation formed to combat antisemitism and other forms of discrimination, said the posts were \"irresponsible, dangerous and antisemitic.\"\"This supercharging of extremist rhetoric will only amplify and encourage the antisemitism that is already surging on X and many other platforms,\" ADL wrote on X.X users have shared responses made by Grok when it was queried about posts that appeared to celebrate the deaths of children in the recent Texas floods.In response to a question asking \"which 20th century historical figure\" would be best suited to deal with such posts, Grok said: \"To deal with such vile anti-white hate? Adolf Hitler, no question.\"\"If calling out radicals cheering dead kids makes me 'literally Hitler,' then pass the mustache,\" said another Grok response. \"Truth hurts more than floods.\"Separately, a Turkish court has blocked access to Grok after it generated responses that the authorities said included insults to President Tayyip Erdogan.The office of Ankara's chief prosecutor has launched a formal investigation into the incident, in what is Turkey's first such ban on access to an AI tool.Meanwhile, the Polish authorities have reported xAI to the European Commission alleging Grok made offensive comments about Polish politicians, including Prime Minister Donald Tusk.Poland's digitisation minister, Krzysztof Gawkowski, told Polish radio station RMF FM: \"We will report the violation to the European Commission to investigate and possibly impose a fine on X. Freedom of speech belongs to humans, not to artificial intelligence.\"The controversy comes at a difficult time for Musk, with X CEO Linda Yaccarinorevealing she was stepping downon Wednesday after two years running the social media platform.\n\nOn Friday, Muskposted on Xthat Grok had improved \"significantly\", but gave no details of what changes had been made.\"You should notice a difference when you ask Grok questions,\" he added.The chatbot drew criticism earlier this year after it repeatedly referenced \"white genocide\" in South Africa in response to unrelated questions - an issue that the company said was caused by an \"unauthorised modification\".In January, Musk himself faced a backlash over a one-armed gesture he gave during a speech celebrating the inauguration of Donald Trump.At a Trump rally, Musk thanked the crowd for \"making it happen\", before placing his right hand over his heart and then thrusting the same arm out into air straight ahead of him. He then turned and repeated the action for those sitting behind him.Some X users likened the gesture to a Nazi salute, though others disagreed.In response, the SpaceX and Tesla chief posted on X: \"Frankly, they need better dirty tricks. The 'everyone is Hitler' attack is sooo tired.\"X, which was formerly called Twitter, was merged with xAI earlier this year.Chatbot developers have faced extensive scrutiny over concerns around political bias, hate speech and accuracy in recent years.Musk has also previously been criticised over claims that he amplifies conspiracy theories and other controversial content on social media.",
    "images": [
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/7517/live/4e56eb10-5c7a-11f0-90fe-f359e5a233e4.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/dfd5/live/a6c3d400-479b-11f0-852d-2b00931dcf75.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/8280/live/e4ea0d20-5bce-11f0-aee9-4be0a810fe02.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/7693/live/4de86b10-414d-11f0-bace-e1270fc31f5e.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/92ca/live/478a2040-5d65-11f0-a40e-a1af2950b220.png.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/7d08/live/654466b0-5d4a-11f0-aad2-47873d8a8a60.jpg.webp"
    ],
    "scraped_at": "2025-07-11T09:33:29.594350"
  },
  {
    "url": "https://www.bbc.com/news/articles/cwykgrv374eo",
    "title": "Four arrested in connection with M&S and Co-op cyber-attacks",
    "timestamp": "2025-07-10T13:42:24.367Z",
    "author": null,
    "category": "innovation",
    "tags": [],
    "content": "Four people have been arrested by police investigating the cyber-attacks that have caused havoc at M&S and the Co-op.The National Crime Agency (NCA) says a 20-year-old woman was arrested in Staffordshire, and three males - aged between 17 and 19 - were detained in London and the West Midlands.They were apprehended on suspicion of Computer Misuse Act offences, blackmail, money laundering and participating in the activities of an organised crime group.All four were arrested at their homes in the early hours of Thursday. Electronic devices were also seized by the police.One of the suspects - a 19-year-old man - is from Latvia, the rest are from the UK.\n\nNeighbours described a large police operation in the quiet Staffordshire cul-de-sac  where the 20-year-old was arrested.They said dozens of NCA officers, some wearing balaclavas, arrived in the early hours of this morning and smashed down the door of a family home. Later they were seen taking away a large number of electronic devices.Paul Foster, head of the NCA's National Cyber Crime Unit, said the arrests were a \"significant step\" in its investigation.\"But our work continues, alongside partners in the UK and overseas, to ensure those responsible are identified and brought to justice,\" he added.\n\nThe hacks - which began in mid April - have caused huge disruption for the two retailers.Some Co-op shelves were left bare for weeks, while M&S expects its operations to be affected until late July, with some IT systems not fully operational until October or November.The chairman of M&S told MPs this week that it felt like the hack was anattempt to destroy the business. The retailer has estimated it will cost it £300m in lost profits.Harrods was also targeted in an attack that had less impact on its operations.\n\nM&S was the first to be breached. A huge amount of private data belonging to customers and staff was stolen.The criminals also deployed malicious software called ransomware scrambling the company's IT networks making them unusable unless a ransom was paid.The BBC revealed that the hackers hadsent an offensive emailto the M&S boss demanding payment.A few days after M&S was breached the Co-op was also targeted by criminals who broke in and stole the private data of millions of its customers and staff.The Co-op wasforced to admitthat the data breach had happened after hackers contacted the BBC with proof that the firm was downplaying the cyber attack.The BBC later discovered from the criminals thatthe company disconnected the internetfrom IT networks in the nick of time to stop the hackers from deploying ransomware and so causing even more disruption.Shortly after Co-op announced it had been attacked, luxury retailer Harrods said it too had been targeted and had been forced to disconnect IT systems from the internet to keep the criminals out.The four people arrested are a 17-year-old British male from the West Midlands, a 19-year-old British man from London, a 19-year-old Latvian male from the West Midlands and a 20-year-old British woman from Staffordshire.The NCA said its operation was supported by officers from the West Midlands Regional Organised Crime Unit and the East Midlands Special Operations Unit.\n\nSign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here.",
    "images": [
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/4ec9/live/6bd69a00-5d92-11f0-9297-dd87eb704fa9.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/8dc3/live/2928c9c0-5d93-11f0-960d-e9f1088a89fe.png.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/41d3/live/348b21e0-26a8-11f0-8f57-b7237f6a66e6.png.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/0b37/live/6631ac60-5c17-11f0-975c-5f75a80da356.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/fbbb/live/92a73f90-46b3-11f0-9471-e380f647874e.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/f1e3/live/a63cae70-3f9f-11f0-aefb-5bdcf7b5706c.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/ce1a/live/08db5060-3af3-11f0-9a86-f7906cd4e14e.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/2ed8/live/919d6a50-3805-11f0-981f-292340dd0d9d.jpg.webp"
    ],
    "scraped_at": "2025-07-11T09:33:30.190683"
  },
  {
    "url": "https://www.bbc.com/news/articles/ce8zqvgpm3lo",
    "title": "Esports World Cup: The contest teams can't afford to miss",
    "timestamp": "2025-07-08T15:23:35.613Z",
    "author": null,
    "category": "innovation",
    "tags": [],
    "content": "The second Esports World Cup (EWC) has begun in Riyadh, Saudi Arabia.Over the next seven weeks, teams from around the world will compete across 25 games including Call of Duty, League of Legends and EA Sports FC (EA FC).Up for grabs is a share of $70m (£50m).There are prizes for individuals and teams but, despite the tournament's name, players don't compete for their countries.Most are members of organisations such as Team Liquid, one of the world's biggest esports squads.BBC Newsbeat went behind the scenes at their HQ to find out why the EWC is so important to them, and why they feel they can't ignore the controversial contest.\n\nLocated in Utrecht in the Netherlands, Team Liquid's base is part office, part video game arcade and part luxury student accommodation.There are two rooms where team-mates can compete head-to-head or online, and streaming booths where they can broadcast live to followers on Twitch.Many of Liquid's top players live and train in the building, where an on-site chef provides three meals a day, all of them designed to boost concentration and reaction times.When play is work and work is play it's important to distinguish between the two, and members tell Newsbeat they spend about eight hours a day training in the run-up to major competitions.\n\nOne of those is Levi de Weerd.Like many others he got into EA FC (formerly known as Fifa) as a child.Now aged 21, he's made playing against the best against the world into a career.He says being part of Team Liquid gets him access to the high-spec facilities and experienced coaches.\"We have a gameplay coach, we're analysing games from tournaments in the past and in friendly games where we try things out. We have performance coaches and mental coaches too,\" he says.Being in one place, he says, is more important than you might think.\"I think it's important to have a good environment with coaches, with players and staff to get a good chemistry\", he says.\n\nBecause EWC competitors don't represent their countries, teams are able to bring in talent from around the world.YanYa, part of Team Liquid's Apex Legends squad, joined from his home country of Mexico.He says the EWC is \"the best feeling in the world because you are playing the best players\".\"You get a lot of excitement. You get a lot of adrenaline,\" he says.Team Liquid are looking to one-up their performance last year, when they finished second overall behind Saudi side Team Falcons.YanYa insists that doesn't affect him, though.\"I don't feel pressure, I feel confident,\" he says. \"We've been practising a lot.\"\n\nIndividual performance is a key part of the EWC and there are big cash prizes for winning players.But there are also special bonuses for the club championship - the team that wins the most events overall gets $7m (£5m).More players means a chance to compete in more events, and a greater chance of netting that top prize.Levi is a fairly new member of Team Liquid, which he joined when his former side was absorbed into it.Consolidation - bigger esports teams swallowing smaller ones - and mergers have become more common, and not just because of the prizes up for grabs.Multiple esports organisations have gone bust in recent years after a massive investment boom in the scene fizzled out.Team Liquid's founder and co-CEO Victor Goosens says keeping the money coming in is more important than ever.\n\nWhile prize money isn't everything, Victor says the EWC is financially important for Team Liquid.\"It's another source we can plan around and project our year for and that allows us to build the company and establish ourselves as a sustainable esports organisation\", he says.He says the team is \"ambitious\" with its plans to win the club championship, after placing second last year.Victor admits it's necessary to compete in as many events as possible in order to take the top spot, but that \"it's not worth expanding if your core rosters aren't already great\".You need to attract the best talent.So when online chess was added as an event at this year's Esports World Cup, Team Liquid signed up the world's top chess grandmasters Magnus Carlsen and Fabiano Caruana.\n\nSome esports fans have been critical of teams taking part in an event hosted, and largely funded, by Saudi Arabia.The kingdom has been accused of numerous human rights violations and has strict laws restricting what women can do.Like other Middle East states it's been heavily criticised for its anti-LGBT laws - homosexuality is punishable by death.It's heavily invested millions into sport, video games and esports, which critics argue is an attempt to boost its public image.There has been backlash.Individual players have chosen not to participate, such as Street Fighter 6 pro Chris CCH, whodeclined a spot at this year's contestafter qualifying via a partnered event.But, given its ever-growing ties to esports, he admitted that avoiding any Saudi-linked contests altogether would have made it almost impossible for him to carry on competing.Victor says it's a \"sensitive and tricky situation to navigate\" for Team Liquid, which has publicly supported gay rights.\"We've been very outspoken that we believe in esports for all,\" says Victor.\"So there's a contradiction. But we believe that if we want to be around in five or ten years' time we need to play at the EWC.\"\n\nListen to Newsbeatliveat 12:45 and 17:45 weekdays - or listen backhere.",
    "images": [
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/db36/live/59ccd780-5bcf-11f0-aee9-4be0a810fe02.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/188c/live/e45a3520-5c0e-11f0-af65-4b31fe04415f.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/fe11/live/68aa6cd0-5bd0-11f0-aee9-4be0a810fe02.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/353d/live/ba776f40-5bd0-11f0-aee9-4be0a810fe02.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/2eed/live/bb52eb40-5c09-11f0-960d-e9f1088a89fe.png.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/ab03/live/089e3d80-5c07-11f0-b5c5-012c5796682d.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/7693/live/4de86b10-414d-11f0-bace-e1270fc31f5e.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/92ca/live/478a2040-5d65-11f0-a40e-a1af2950b220.png.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/7517/live/4e56eb10-5c7a-11f0-90fe-f359e5a233e4.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/dd15/live/eb7a0960-5ccd-11f0-ac2f-d518c8150550.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/d256/live/e05953e0-5bee-11f0-9584-0dcfb55e8671.jpg.webp"
    ],
    "scraped_at": "2025-07-11T09:33:30.796877"
  },
  {
    "url": "https://www.bbc.com/news/articles/c3d1z9zlx78o",
    "title": "States of Guernsey to bring more services online",
    "timestamp": "2025-07-11T05:19:07.016Z",
    "author": null,
    "category": "innovation",
    "tags": [],
    "content": "The States of Guernsey is planning to bring more services online with the introduction of an artificial intelligence (AI) platform.The government is working with digital transformation company EPAM to implement the ServiceNow platform and to provide \"much needed\" application support services for the Revenue Service, at a cost of about £5m.Gé Drossaert, the States' chief digital and information officer, said the AI platform would \"deliver the digital capabilities the island needs\".He said it would provide the digital foundation to enable further services to be brought online in future.\n\nMr Drossaert said ServiceNow was a well-established cloud-based AI-enhanced platform that automated processes, which was crucial for the needed digital transformation of States of Guernsey services.\"This will be a long-term project, as we will be starting with getting the digital foundations in place that gives us the capabilities we need to develop a roadmap to increasing over time the number of digital services we offer to the community,\" he added.A States' spokesperson said the long-term aim was for islanders to be able to easily transact with public services online, for the completion of tax returns and online payments, as is possible now, but also for a variety of public services that would be added over time.\n\nThe new platform is said to be a key part of the States' Digital Strategy, which sets out plans for enhancing the security, accessibility and user experience of government services while increasing the efficiency of public service delivery.A States spokesperson said both EPAM and ServiceNow were selected following a competitive tender process.EPAM has also been contracted to provide \"much needed\" application support services for the Revenue Service, previously undertaken by Agilisys, the spokesperson said.\n\nBalazs Fejes, president of global business and chief revenue officer at EPAM, said the company was \"set to enhance the government's digital services, ensuring they are secure, accessible and user-friendly\".He said the firm would be launching an EPAM branch in Guernsey to give them a physical presence on the island, adding they would be looking to create employment opportunities locally.Damian Stirrett, group vice president and general manager, UK and Ireland at ServiceNow, said the \"collaboration will help deliver secure, accessible, and user-centric digital experiences for islanders\".\n\nFollow BBC Guernsey onXandFacebookandInstagram. Send your story ideas tochannel.islands@bbc.co.uk.",
    "images": [
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/dfd5/live/a6c3d400-479b-11f0-852d-2b00931dcf75.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/1c5d/live/34cef110-5db0-11f0-994b-7bf5a5074c2f.png.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/d5c8/live/84bd3790-5ce3-11f0-b827-c5743c3815ad.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/980e/live/bd65ffa0-5cc0-11f0-a847-6f5cde5d04a4.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/122a/live/3c746e10-5c14-11f0-a242-c52ffeb44368.jpg.webp",
      "https://ichef.bbci.co.uk/news/1536/cpsprodpb/e0c0/live/74273300-5c15-11f0-b5c5-012c5796682d.jpg.webp"
    ],
    "scraped_at": "2025-07-11T09:33:31.467784"
  }
]